[{"NID":"73357","Title":"\"Unauthorized sexual enhancement products may pose serious health risks\"","URL":"https:\/\/recalls-rappels.canada.ca\/en\/alert-recall\/unauthorized-sexual-enhancement-products-may-pose-serious-health-risks","Organization":"Health Canada","Product":"Various unauthorized health products promoted for sexual enhancement","Issue":"Unauthorized product","What you should do":"\"Stop using the products listed in the table. Consult your health care professional if you have used these products and have health concerns, and for advice on which health products are best for you and your family.Read product labels to verify that health products have been authorized for sale by Health Canada. Authorized health products have an eight-digit Drug Identification Number (DIN), Natural Product Number (NPN) or Homeopathic Drug Number (DIN-HM). You can also check if products have been authorized for sale by searching Health Canada's Drug Product Database and Licensed Natural Health Product Database.Report any health product adverse events or complaints to Health Canada.See these helpful links for additional information on buying health products safely:Buying drugs over the InternetAdulteration of natural health productsRisks of buying natural health products onlineThe safe use of health products for weight lossWhat companies should know:Selling unauthorized health products in Canada is illegal.When Health Canada identifies unauthorized products that may pose serious health risks, Health Canada takes appropriate action to prevent further distribution and informs the public. This includes working with the Canada Border Services Agency to help prevent further importation of unauthorized products.\"","Category":"Health products - Drugs","Recall class":"","Last updated":"2024-01-29","Archived":"No"},{"NID":"74816","Title":"\"Global Medium\"","URL":"https:\/\/recalls-rappels.canada.ca\/en\/alert-recall\/global-medium","Organization":"Health Canada","Product":"Global Medium","Issue":"Performance issue","What you should do":"","Category":"Health products - Medical devices - Chemistry","Recall class":"Type II","Last updated":"2023-12-27","Archived":"No"}]